In [8]:
import pandas as pd

In [10]:
#Fazendo a leitura das planilhas no excel

df1 = pd.read_excel('./datasets/Aracaju.xlsx')
df2 = pd.read_excel('./datasets/Fortaleza.xlsx')
df3 = pd.read_excel('./datasets/Natal.xlsx')
df4 = pd.read_excel('./datasets/Recife.xlsx')
df5 = pd.read_excel('./datasets/Salvador.xlsx')

In [14]:
df = pd.concat([df1,df2,df3,df4,df5])
df.head

<bound method NDFrame.head of        Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]>

In [18]:
#Pegando uma amostra do dataset 
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
41      Recife 2019-02-13  157.78     981     4
109  Fortaleza 2019-03-02   18.90     982     6
60    Salvador 2019-01-01   96.01    1034     2
184      Natal 2019-01-02  167.16    1037     1
93       Natal 2019-01-02   15.58    1037     1

In [19]:
#Alterando o tipo de dado da coluna LojaID em objeto 

df["LojaID"] = df["LojaID"].astype("object")

In [20]:
#Verificando se existe dados falatantes em nossos dados 

df.isnull().sum()

#Como pode ser visto abaixo não existe nenhum valor nulo em nenhuma de nossas colunas
#Caso existisse os procedimento dos próximo bloc deveria ser executado

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [21]:
#Verificando a média das vendas 

df['Vendas'].mean()

122.61180089485438

In [ ]:
#Susbitituindo os valores nulos pela média


#df["Vendas"].fillna(df['Vendas'].mean(), inplace=True)

#Substituindo os valores nulos por zero

#df["Vendas"].fillna(0, inplace=True)

#Retirando os possiveis valores nulos

#df.dropna(subset=["Vendas"], inplace=True)

#Caso desejassemos retirar valore nulos nas outras colunas, deveriamos proceder da seguinte forma
#df.dropna(how="all", inplace=True)

Criando colunas novas

In [23]:
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [25]:
#Caso tivessemos a recita e a quantidade mas não tivessemos a quantidade vedna de cada produto

df["Receita/Vendas"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [26]:
#Verificando o maior valor na coluna Receita

df["Receita"].max()

3544.0

In [27]:
#Verificando o menor valor na coluna Receita

df["Receita"].min()

3.34

In [28]:
#Abaixo utilizaremos o operador nlargest para verifar o top 3 dos que obtiveram a maior receita
#Vale ressaltar que ele nos retornara a linha de cada um dos 3 maiores valores 

df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [29]:
#Abaixo utilizaremos o operador nsmallest para verifar top 3 dos que obtiveram a menor receita
#Vale ressaltar que ele nos retornara a linha de cada um dos 3 menores valores 

df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [30]:

df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [32]:
#Ordenando o conjunto de dados 

df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0